{
	"name":"cfexchangemail",
	"type":"tag",
	"syntax":"<cfexchangemail meetinguid=\"\" message=\"\" name=\"\" uid=\"\">",
	"related":[],
	"description":"Gets mail messages and attachments, deletes messages, and sets properties for messages on a Microsoft Exchange server.\n The cfexchangemail tag performs mail actions on an Exchange server that you cannot do using the cfmail tag.",
	"params": [
		{"name":"action","description":"The name to use for the JavaScript proxy class. (required)","required":false,"default":"","type":"string","values":["get","getAttachments","getMeetingInfo","delete","deleteAttachments","move","set"]},
		{"name":"attachmentPath","description":"The file path of the directory in which to put the attachments.\n If the directory does not exist, ColdFusion creates it.\n If you omit this attribute, ColdFusion does not save any attachments.\n If you specify a relative path, the path root is the ColdFusion temporary directory, which is returned by the GetTempDirectory function. (optional)","required":false,"default":"","type":"string","values":[]},
		{"name":"connection","description":"The name of the connection to the Exchange server, as specified in the cfexchangeconnection tag.\n If you omit this attribute, and you specify cfexchangeconnection tag attributes in this tag, Coldfusion creates a temporary connection. (optional)","required":false,"default":"","type":"variableName","values":[]},
		{"name":"folder","description":"The forward slash (\/) delimited path, relative to the inbox, of the folder that contains the message or messages.\n The cfechangemail tag looks in the specified folder only, and does not search subfolders.\n If you omit this attribute, Exchange looks in the top level of the inbox. (optional)","required":false,"default":"","type":"string","values":[]},
		{"name":"generateUniqueFilenames","description":"A Boolean value specifying whether to generate unique file names if multiple attachments have the same file names.\n Case \"yes\": 3x myfile.txt -> myfile.txt, myfile1.txt, and myfile2.txt. (optional, default=no)","required":false,"default":"","type":"boolean","values":[true,false]},
		{"name":"mailUID","description":"The case-sensitive UID of the mail message that contains the meeting request, response, or cancellation notfication.\n You can use this attribute if there are multiple messages about a single meeting. (optional)","required":false,"default":"","type":"string","values":[]},
		{"name":"meetingUID","description":"The case-sensitive UID of the meeting for which you received the notification. (required)","required":true,"default":"","type":"string","values":[]},
		{"name":"message","description":"A reference to a structure that contains the properties to be set and their values.\n You must specify this attribute in number signs (#). (required)","required":true,"default":"","type":"any","values":[]},
		{"name":"name","description":"The name of the ColdFusion query variable that will contain the returned mail messages or information\n about the attachments that were retrieved. (required)","required":true,"default":"","type":"string","values":[]},
		{"name":"UID","description":"The case-sensitive UIDs of the messages on which to perform the action.\n For the delete action, this attribute can be a comma delimited list of UID values.\n The getAttachments and set actions allow only a single UID value. (required)","required":true,"default":"","type":"string","values":[]},
		{"name":"destinationfolder","description":"The forward slash (\/) delimited path, relative to the root of the mailbox, of the folder to which to move the message or messages.","required":false,"default":"","type":"string","values":[]}

	],
	"engines": {
		"coldfusion": {"minimum_version":"", "notes":"", "docs":"https://helpx.adobe.com/coldfusion/cfml-reference/coldfusion-tags/tags-d-e/cfexchangemail.html"}
	},
	"links": [

	]

}
