{
	"name":"cfexchangetask",
	"type":"tag",
	"syntax":"<cfexchangetask task=\"\" name=\"\" uid=\"\">",
	"related":[],
	"description":"Creates, deletes, modifies, and gets Microsoft Exchange tasks, and gets task attachments.",
	"params": [
		{"name":"action","description":"The action to take. Must be one of the following: create, delete, get, getAttachments, modify (optional)","required":false,"default":"","type":"string","values":["create","delete","deleteAttachments","get","getAttachments","modify"]},
		{"name":"attachmentPath","description":"The file path of the directory in which to put the attachments.\n If the directory does not exist, ColdFusion creates it.\n If you omit this attribute, ColdFusion does not save any attachments.\n If you specify a relative path, the path root is the ColdFusion temporary directory, which is returned\n by the GetTempDirectory function. (optional)","required":false,"default":"","type":"string","values":[]},
		{"name":"connection","description":"The name of the connection to the Exchange server, as specified in the cfexchangeconnection tag.\n If you omit this attribute, and you specify cfexchangeconnection tag attributes in this tag,\n Coldfusion creates a temporary connection. (optional)","required":false,"default":"","type":"variableName","values":[]},
		{"name":"task","description":"A reference to the structure that contains the task properties to be set or changed and their values.\n You must specify this attribute in number signs (#).\n For more information on the event structure, see the Usage section. (required)","required":true,"default":"","type":"any","values":[]},
		{"name":"name","description":"The name of the ColdFusion query variable that will contain the returned mail messages or information\n about the attachments that were retrieved. (required)","required":true,"default":"","type":"string","values":[]},
		{"name":"results","description":"(create) The name of a variable that will contain the UID of the task that is created.\n You use this value in the uid attribute of other actions to identify the task to be acted on. (optional)","required":false,"default":"","type":"string","values":[]},
		{"name":"uid","description":"A case-sensitive Exchange UID value that uniquely identifies the tasks on which to perform the action.\n For the delete action, this attribute can be a comma delimited list of UID values.\n The getAttachments and modify action allow only a single UID value. (optional)","required":true,"default":"","type":"string","values":[]},
		{"name":"result","description":"The name of a variable that contains the UID of the task that is created. You use this value in the uid attribute of other actions to identify the task to be acted on.","required":false,"default":"","type":"string","values":[]}

	],
	"engines": {
		"coldfusion": {"minimum_version":"", "notes":"", "docs":"https://helpx.adobe.com/coldfusion/cfml-reference/coldfusion-tags/tags-d-e/cfexchangetask.html"}
	},
	"links": [

	]

}
