{
	"name":"cffunction",
	"type":"tag",
	"syntax":"<cffunction name=\"\">",
	"script": "public boolean function myFunction(required any myArgument) { }",
	"related":["cfargument","cfcomponent"],
	"description":"Defines a function that you can call in CFML. Required to\n defined CFML component methods.",
	"params": [
		{"name":"name","description":"A string; a component method that is used within the\n cfcomponent tag.","required":true,"default":"","type":"string","values":[]},
		{"name":"returntype","description":"String; a type name; data type of the function return value\n Required for a web service; Optional, otherwise.","required":false,"default":"any","type":"string","values":["any","array","binary","boolean","date","guid","numeric","query","string","struct","UUID","variablename","void","xml","(component name)"]},
		{"name":"roles","description":"A comma-delimited list of CFML security roles that\n can invoke the method. Only users who are logged in with\n the specified roles can execute the function. If this\n attribute is omitted, all users can invoke the method","required":false,"default":"","type":"string","values":[]},
		{"name":"access","description":"The client security context from which the method can be\n invoked:\n\n private: available only to the component that declares the\n method and any components that extend the component in\n which it is defined\n package: available only to the component that declares the\n method, components that extend the component, or any\n other components in the package\n public: available to a locally executing page or component\n method\n remote: available to a locally or remotely executing page\n or component method, or a remote client through a URL,\n Flash, or a web service. To publish the function as a\n web service, this option is required.","required":false,"default":"public","type":"string","values":["private","package","public","remote"]},
		{"name":"output","description":"Specifies under which conditions the function can generate\n HTML output.","required":false,"default":"","type":"boolean","values":[true,false]},
		{"name":"displayname","description":"Meaningful only for CFC method parameters. A value to be\n displayed in parentheses following the function name when\n using introspection to show information about the CFC","required":false,"default":"","type":"string","values":[]},
		{"name":"hint","description":"Meaningful only for CFC method parameters. Text to be\n displayed when using introspection to show information\n about the CFC. The hint attribute value follows the syntax\n line in the function description","required":false,"default":"","type":"string","values":[]},
		{"name":"description","description":"Supplies a short text description of the function.","required":false,"default":"","type":"string","values":[]},
		{"name":"returnformat","description":"The format in which to return values to a remote caller.","required":false,"default":"","type":"string","values":["JSON","plain","WDDX"]},
		{"name":"securejson","description":"A Boolean value that specifies whether to add a security prefix in front of any value that the function returns in JSON-format in response to a remote call.","required":false,"default":"","type":"boolean","values":[true,false]},
		{"name":"verifyclient","description":"A Boolean value that specifies whether to require remote function calls to include an encrypted security token. For use with ColdFusion AJAX applications only.","required":false,"default":"","type":"boolean","values":[true,false]},
		{"name":"restPath","description":"Specify to use a sub- resource path for the CFC. The path is case-sensitive. Also, it is preferable to avoid special characters when you specify the path. You can include regular expressions in the path. For details of the expressions that you can specify, see the attribute restPath in cfcomponent.","required":false,"default":"","type":"string","values":[]},
		{"name":"httpMethod","description":"The HTTP method to use, must be one of the following:\n\nGET: Requests information from the server. Any data that the server requires to identify the requested information must be in the URL or in `cfhttp type=\"URL\"` tag.\n\nPOST: Sends information to the server for processing. Requires one or more cfhttpparam tags. Often used for submitting form-like data.\n\nPUT: Requests the server to store the message body at the specified URL. Use this method to send files to the server.\n\nDELETE: Requests the server to delete the specified URL.\n\nHEAD: Identical to the GET method, but the server does not send a message body in the response. Use this method for testing hypertext links for validity and accessibility, determining the type or modification time of a document, or determining the type of server. If you have not specified HEAD, by default, GET method is called. However, message body is not sent in the response.\n\nOPTIONS: A request for information about the communication options available for the server or the specified URL. This method enables the ColdFusion application to determine the options and requirements associated with a URL, or the capabilities of a server, without requesting any additional activity by the server. If you have not specified OPTIONS, then ColdFusion sends a response.\nOverrides the value that you specify at component level.","required":false,"default":"","type":"string","values":["get","post","put","delete","head","options"]},
		{"name":"produces","description":"Comma-separated list of acceptable MIME types. Used to specify the MIME media type of representation a resource can produce, for example, {{produces=\"text/plain,text/html\"}} If a resource can produce more than one MIME media type, the function chosen corresponds to the most acceptable media type as declared by the client. If no value is specified, / is taken by default, which means, all MIME types are consumed. Overrides the value that you specify at the component level.\n\n <b>Note</b>\nIf MIME type is a wildcard, the results include any value. For example, if you a make a http call with produces as '*/xml' and follow it up with a second http call with produces as '*/json', the results in the second http call might include the first call result as well. ","required":false,"default":"","type":"string","values":[]},
		{"name":"consumes","description":"Comma-separated list of acceptable MIME types, for example consumes=\"text/plain,text/html\".Used to specify which MIME media types of representation a resource can accept, or consume, from the client. This attribute overrides the same attribute at the component level.\nIf no value is specified, / is taken by default, which means, all MIME types are consumed. Adobe recommends that you avoid conflict scenarios while specifying the attributes produces and consumes. For example, avoid situations such as the following: In function 1, you specify produces as text/xml and consumes as text/ and in function 2, produces as text/ and consumes as text/xml. Here, both the functions are valid for the request with accept = text/xml and consumes as text/xml.","required":false,"default":"","type":"string","values":[]}
	],
	"engines": {
		"coldfusion": {"minimum_version":"6", "notes":"", "docs":"https://helpx.adobe.com/coldfusion/cfml-reference/coldfusion-tags/tags-f/cffunction.html"},
		"lucee": {"minimum_version":"", "notes":"", "docs":"http://docs.lucee.org/reference/tags/function.html"},
		"railo": {"minimum_version":"", "notes":"", "docs":"http://railodocs.org/index.cfm/tag/cffunction"},
		"openbd": {"minimum_version":"", "notes":"", "docs":"http://openbd.org/manual/?/tag/cffunction"}
	},
	"links": [

	],
	"examples": [
		{
			"title": "Script Syntax",
			"description": "",
			"code": "public boolean function myFunction(required any myArgument) { \r\n  // Some function bits \r\n return true; \r\n }",
			"result": ""
		},
	        {
	            "title": "Tag Syntax",
	            "description": "",
	            "code": "<cffunction access=\"public\" returntype=\"boolean\" name=\"myFunction\"> \r\n <cfargument required=\"true\" type=\"any\" name=\"myArgument\"> \r\n <!--- Some function bits ---> \r\n <cfreturn true> \r\n </cffunction>",
	            "result": ""
	        }
	]

}
