{
	"name":"cfhttp",
	"type":"tag",
	"syntax":"<cfhttp url=\"\">",
	"related":["cfhttpparam"],
	"description":"Generates an HTTP request and parses the response from the server into a structure. The result structure has the following keys:\n`statusCode` : The HTTP response code and reason string.\n`fileContent` : The body of the HTTP response. Usually a string, but could also be a Byte Array.\n`responseHeader` : A structure of response headers, the keys are header names and the values are either the header value or an array of values if multiple headers with the same name exist.\n`errorDetail` : An error message if applicable.\n`mimeType` : The mime type returned in the Content-Type response header.\n`text` : a boolean indicateing if the response body is text or binary.\n`charset` : The character set returned in the Content-Type header.\n`header` : All the http response headers as a single string.",
	"params": [
		{"name":"url","description":"Address of the resource on the server which will handle\n the request. The URL must include the hostname or IP\n address.\n\n If you do not specify the transaction protocol (http:\/\/ or\n https:\/\/), CFML defaults to http.\n\n If you specify a port number in this attribute, it\n overrides any port attribute value.\n\n The cfhttpparam tag URL attribute appends query string\n attribute-value pairs to the URL.","required":true,"default":"","type":"URL","values":[]},
		{"name":"port","description":"Port number on the server to which to send the request.\n A port value in the url attribute overrides this value.\n (default: http 80 - https 443)","required":false,"default":80,"type":"numeric","values":[]},
		{"name":"method","description":"* GET Requests information from the server. Any data that\n the server requires to identify the requested\n information must be in the URL or in cfhttp type=\"URL\"\n tags.\n * POST Sends information to the server for processing.\n Requires one or more cfhttpparam tags. Often used for\n submitting form-like data.\n * PUT Requests the server to store the message body at the\n specified URL. Use this method to send files to the\n server.\n * DELETE Requests the server to delete the specified URL.\n * HEAD Identical to the GET method, but the server does\n not send a message body in the response. Use this\n method for testing hypertext links for validity and\n accessibility, determining the type or modification\n time of a document, or determining the type of server.\n * TRACE Requests that the server echo the received HTTP\n headers back to the sender in the response body. Trace\n requests cannot have bodies. This method enables the\n CFML application to see what is being received\n at the server, and use that data for testing or\n diagnostic information.\n * OPTIONS A request for information about the\n communication options available for the server or the\n specified URL. This method enables the CFML\n application to determine the options and requirements\n associated with a URL, or the capabilities of a server,\n without requesting any additional activity by the\n server.\n * PATCH: requests partial updates to the requested entity at the specified URL. Use this method to modify parts of the resource whereas use PUT method to completely replace the resource at the specified URL. CF11+ ","required":false,"default":"get","type":"string","values":["get","post","put","delete","head","trace","options","patch"]},
		{"name":"proxyserver","description":"The proxy server required to access the URL.","required":false,"default":"","type":"string","values":[]},
		{"name":"proxyport","description":"The port to use on The proxy server.","required":false,"default":80,"type":"numeric","values":[]},
		{"name":"proxyuser","description":"The user ID to send to the proxy server.","required":false,"default":"","type":"string","values":[]},
		{"name":"proxypassword","description":"The user's password on the proxy server.","required":false,"default":"","type":"string","values":[]},
		{"name":"username","description":"A username. May be required by server.","required":false,"default":"","type":"string","values":[]},
		{"name":"password","description":"A password. May be required by server","required":false,"default":"","type":"string","values":[]},
		{"name":"useragent","description":"Text to put in the user agent request header. Used to\n identify the request client software. Can make the\n CFML application appear to be a browser.","required":false,"default":"ColdFusion","type":"string","values":[]},
		{"name":"charset","description":"TThe character encoding of the request, including the URL\n query string and form or file data, and the response.\n\n For more information on character encodings, see:\n www.w3.org\/International\/O-charset.html.","required":false,"default":"","type":"string","values":["utf-8","iso-8859-1","windows-1252","us-ascii","shift_jis","iso-2022-jp","euc-jp","euc-kr","big5","euc-cn","utf-16"]},
		{"name":"resolveurl","description":"No does not resolve URLs in the response body. As a result,\n any relative URL links in the response body do not work.\n Yes resolves URLs in the response body to absolute URLs,\n including the port number, so that links in a retrieved\n page remain functional.","required":false,"default":false,"type":"boolean","values":[true,false]},
		{"name":"throwonerror","description":"Yes if the server returns an error response code, throws\n an exception that can be caught using the cftry and\n cfcatch or CFML error pages.\n No does not throw an exception if an error response is\n returned. In this case, your application can use the\n cfhttp.StatusCode variable to determine if there was\n an error and its cause.","required":false,"default":false,"type":"boolean","values":[true,false]},
		{"name":"redirect","description":"If the response header includes a Location field,\n determines whether to redirect execution to the URL\n specified in the field.","required":false,"default":true,"type":"boolean","values":[true,false]},
		{"name":"timeout","description":"Value, in seconds of the maximum time the request can take.\n If the timeout passes without a response, CFML\n considers the request to have failed.","required":false,"default":"","type":"numeric","values":[]},
		{"name":"getasbinary","description":"* No If CFML does not recognize the response body\n type as text, convert it to a CFML object.\n * Auto If CFML does not recognize the response body\n type as text, convert it to CFML Binary type data.\n * Yes Always convert the response body content into\n CFML Binary type data, even if CFML\n recognizes the response body type as text.","required":false,"default":"auto","type":"string","values":["auto",false,true]},
		{"name":"result","description":"CF7+ Specifies the name of the variable in which you want the result returned. ","required":false,"default":"cfhttp","type":"string","values":[]},
		{"name":"delimiter","description":"A character that separates query columns. The response body must use this character to separate the query columns.","required":false,"default":"","type":"string","values":[",",";","|",":"]},
		{"name":"name","description":"Tells ColdFusion to create a query object with the given\n name from the returned HTTP response body.","required":false,"default":"","type":"string","values":[]},
		{"name":"columns","description":"The column names for the query, separated by commas, with no\n spaces. Column names must start with a letter. The remaining\n characters can be letters, numbers, or underscore\n characters (_).\n \n If there are no column name headers in the response,\n specify this attribute to identify the column names.\n \n If you specify this attribute, and the firstrowasHeader\n attribute is True (the default), the column names specified\n by this attribute replace the first line of the response.\n You can use this behavior to replace the column names\n retrieved by the request with your own names.\n \n If a duplicate column heading is encountered in either this\n attribute or in the column names from the response,\n ColdFusion appends an underscore to the name to make it\n unique.\n \n If the number of columns specified by this attribute does\n not equal the number of columns in the HTTP response body,\n ColdFusion generates an error.","required":false,"default":"","type":"string","values":[]},
		{"name":"firstrowasheaders","description":"Determines how ColdFusion processes the first row of the\n query record set:\n * yes: processes the first row as column heads. If you\n specify a columns attribute, ColdFusion ignores the\n first row of the file.\n * no: processes the first row as data. If you do not\n specify a columns attribute, ColdFusion generates column\n names by appending numbers to the word \"column\"; for\n example, \"column_1\".","required":false,"default":true,"type":"boolean","values":[true,false]},
		{"name":"textqualifier","description":"A character that, optionally, specifies the start and end\n of a text column. This character must surround any text\n fields in the response body that contain the delimiter\n character as part of the field value.\n \n To include this character in column text, escape it by\n using two characters in place of one. For example, if the\n qualifier is a double-quotation mark, escape it as \"\".","required":false,"default":"\"","type":"string","values":["\"","'"]},
		{"name":"file","description":"Name of the file in which to store the response body. The directory that the file will be written to must be passed in the `path` attribute.","required":false,"default":"","type":"string","values":[]},
		{"name":"multipart","description":"Tells ColdFusion to send all data specified by cfhttpparam type=\"formField\" tags as multipart form data, with a Content-Type of multipart\/form-data.","required":false,"default":false,"type":"boolean","values":[false,true]},
        	{"name":"multipartType","description":"Allows you to set the multipart header field to related or form-data. By default, the value is form-data.","required":false,"default":"form-data","type":"string","values":["form-data","related"]},
		{"name":"clientcertpassword","description":"Password used to decrypt the client certificate.","required":false,"default":"","type":"string","values":[]},
		{"name":"path","description":"Required if File is specified. Tells ColdFusion to save the HTTP response body in a file. Contains the absolute path to the directory in which to store the file.","required":false,"default":"","type":"string","values":[]},
		{"name":"clientcert","description":"The full path to a PKCS12 format file that contains the client certificate for the request.","required":false,"default":"","type":"string","values":[]},
		{"name":"compression","description":"Compression type","required":false,"default":"","type":"string","values":[]},
        	{"name":"authType","description":"CF11+ The supported values are:\n * BASIC\n * NTLM\n NOTE When authentication type is NTLM, do not set the redirect as false.","required":false,"default":"BASIC","type":"string","values":["BASIC","NTLM"]},
        	{"name":"domain","description":"CF11+ The domain name for authentication. (Use for NTLM-based authentication)","required":false,"default":"","type":"string","values":[]},
        	{"name":"workstation","description":"CF11+ The workstation name for authentication. (Use for NTLM-based authentication)","required":false,"default":"","type":"string","values":[]},
		{"name":"cachedwithin","description":"Lucee5+ Timespan, using the CreateTimeSpan function. If original\n file date falls within the time span, cached file data is\n used. CreateTimeSpan defines a period from the present, back.","required":false,"default":"","type":"Timespan","values":[]}
	],
	"engines": {
		"coldfusion": {"minimum_version":"", "notes":"", "docs":"https://helpx.adobe.com/coldfusion/cfml-reference/coldfusion-tags/tags-g-h/cfhttp.html"},
		"lucee": {"minimum_version":"", "notes":"", "docs":"http://docs.lucee.org/reference/tags/http.html"},
		"railo": {"minimum_version":"", "notes":"", "docs":"http://railodocs.org/index.cfm/tag/cfhttp"},
		"openbd": {"minimum_version":"", "notes":"", "docs":"http://openbd.org/manual/?/tag/cfhttp"}
	},
	"links": [

	],
	"examples": [
		{
			"title":"Script Syntax (CF11+)",
			"description":"",
			"code":"cfhttp(method=\"GET\", charset=\"utf-8\", url=\"https://www.google.com/\", result=\"result\") {\r\n    cfhttpparam(name=\"q\", type=\"formfield\", value=\"cfml\");\r\n}\r\nwriteDump(result);",
			"result":""
		},
		{
			"title": "Alternate Script Syntax (CF9+)",
			"description": "",
			"code": "httpService = new http(method = \"GET\", charset = \"utf-8\", url = \"https://www.google.com/\"); \r\n httpService.addParam(name = \"q\", type = \"formfield\", value = \"cfml\"); \r\n result = httpService.send().getPrefix(); \r\n writeDump(result);",
			"result": ""
		},
        {
            "title": "CFHTTP Tag Syntax",
            "description": "",
            "code": "<cfhttp result=\"result\" method=\"GET\" charset=\"utf-8\" url=\"https://www.google.com/\">\r\n    <cfhttpparam name=\"q\" type=\"formfield\" value=\"cfml\">\r\n</cfhttp>\r\n<cfdump var=\"#result#\">",
            "result": ""
        }
	]

}
