{
	"name":"cfthread",
	"type":"tag",
	"syntax":"<cfthread>",
	"script": "thread action=\"\" name=\"\";",
	"related":[],
	"description":"The cfthread tag enables multithreaded programming in ColdFusion.\n Threads are independent streams of execution, and multiple threads\n on a page can execute simultaneously and asynchronously, letting you\n perform asynchronous processing in CFML. CFML code within the cfthread\n tag body executes on a separate thread while the page request thread\n continues processing without waiting for the cfthread body to finish.\n You use this tag to run or end a thread, temporarily stop thread execution,\n or join together multiple threads.",
	"params": [
		{"name":"name","description":"The name of the thread to which the action applies:\n terminate The name of the thread to stop.\n join The name of the thread or threads to join to the current thread.\n To specify multiple threads, use a comma-delimited list.\n run The name to use to identify the thread being created. (required)","required":true,"default":"","type":"string","values":[]},
		{"name":"action","description":"The action to take, one of the following values:\n join Makes the current thread wait until the thread or threads\n specified in the name attribute complete processing, or until the\n period specified in the timeout attribute passes, before continuing\n processing. If you dont specify a timeout and thread you are joining\n to doesnt finish, the current thread also cannot finish processing.\n run Creates a thread and starts it processing.\n sleep Suspends the current threads processing for the time specified\n by the duration attribute. This action is useful if one thread must wait\n for another thread to do processing without joining the threads.\n terminate Stops processing of the thread specified in the name attribute.\n If you terminate a thread, the thread scope includes an ERROR metadata\n structure with information about the termination. (optional, default=run)","required":false,"default":"","type":"string","values":["join","run","sleep","terminate"]},
		{"name":"duration","description":"(sleep) The number of milliseconds for which to suspend thread processing. (required)","required":false,"default":"","type":"string","values":[]},
		{"name":"priority","description":"The priority level at which to run the thread.\n The following values are valid:\n HIGH, LOW, NORMAL\n Higher priority threads get more processing time than lower priority\n threads. Page-level code, the code that is outside of cfthread tags,\n always has NORMAL priority. (optional, default=NORMAL)","required":false,"default":"","type":"string","values":["HIGH","LOW","NORMAL"]},
		{"name":"timeout","description":"The number of milliseconds that the current thread waits for\n the thread or threads being joined to finish. If any thread does not\n finish by the specified time, the current thread proceeds.\n If the attribute value is 0, the default, the current thread continues\n waiting until all joining threads finish. If the current thread is the\n page thread, the page continues waiting until the threads are joined,\n even if you specify a page timeout. (optional, default=0)","required":false,"default":"","type":"numeric","values":[]}

	],
	"engines": {
		"coldfusion": {"minimum_version":"8", "notes":"", "docs":"https://helpx.adobe.com/coldfusion/cfml-reference/coldfusion-tags/tags-t/cfthread.html"},
		"lucee": {"minimum_version":"", "notes":"", "docs":"http://docs.lucee.org/reference/tags/thread.html"},
		"railo": {"minimum_version":"", "notes":"", "docs":"http://railodocs.org/index.cfm/tag/cfthread"},
		"openbd": {"minimum_version":"", "notes":"", "docs":"http://openbd.org/manual/?/tag/cfthread"}
	},
	"links": [

	],
	"examples": [
		{
			"title": "Script Syntax",
			"description": "CF9+",
			"code": "thread action=\"run\" name=\"myThread\" {\r\n // do single thread stuff \r\n} \r\nthread action=\"join\" name=\"myThread,myOtherThread\";",
			"result": ""
		},
	        {
	            "title": "Tag Syntax",
	            "description": "",
	            "code": "<cfthread action=\"run\" name=\"myThread\">\r\n <!--- Do single thread stuff ---> \r\n </cfthread> \r\n <cfthread action=\"join\" name=\"myThread,myOtherThread\" />",
	            "result": ""
	        }
	]

}
