{
    "engines": {"lucee": {"docs": "https://docs.lucee.org/reference/functions/feed.html"}},
    "name": "feed",
    "description": "Reads or creates an RSS or Atom syndication feed.\nThis tag can read various RSS and Atom 0.3 versions. It can create RSS 2.0 or Atom 1.0 feeds.",
    "syntax": "<feed/>",
    "returns": "void",
    "type": "tag",
    "params": [
        {
            "name": "action",
            "description": "The name to use for the JavaScript proxy class.\nThe action to take, one of the following values:\n\n- create: Creates an RSS 2.0 or Atom 1.0 feed XML document and saves it in a variable, writes it to a file, or both.\n- read (default): Parses an RSS or Atom feed from a URL or an XML file and saves it in a structure or query.\n\nYou can also get query metadata in a separate structure.",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "columnmap",
            "description": "Used only for the create action with a query attribute.\nA structure specifying a mapping between the names of the columns in the object specified by the query attribute\nand the columns of the feed format, as described in the Query attribute section.\nThe key for each field must be a column name listed in the Query columns section. The value of the field must be\nthe name of the corresponding column in the query object used as input to the create action.",
            "minimum_version": "str",
            "default": false,
            "type": "struct",
            "required": false
        },
        {
            "name": "enclosuredir",
            "description": "Used only for the read action.\nPath to the directory in which to save any enclosures that are available in the feed being read.\nThe path can be absolute or relative to the CFML file.\nIf the directory does not exist, Lucee generates an error.\nIf you omit this attribute, Lucee does not save enclosures.\nTo specify the directory that contains the current page, set this attribute to .(period).",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "ignoreenclosureerror",
            "description": "If this attribute is true, Lucee attempts to save all enclosures.\n\nIf it encounters an error downloading one enclosure, it continues downloading other enclosures and writes the\nerror information in the server log.\n\nIf this attribute is false, Lucee stops downloading all enclosures and generates an error when it encounters\nan error downloading an enclosure.\n\nNote: Enclosure errors can occur if the specified enclosure is of a type that the web server does not allow to be\ndownloaded. (optional, default=false)",
            "default": false,
            "type": "boolean",
            "required": false
        },
        {
            "name": "name",
            "description": "A structure that contains complete feed data:\nThe output of a read action.\nThe input definition of the feed to create.\nThis structure contains complete feed information.\nWhen you specify the name attribute for a create action, you must put it in pound signs (#).",
            "default": false,
            "type": "any",
            "required": false
        },
        {
            "name": "outputfile",
            "description": "Path of the file in which to write the feed as XML text.\nThe path can be absolute, or relative to the CFML file.",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "overwrite",
            "description": "Whether to overwrite the XML feed file if it already exists.\nIf you do not set this attribute to true and the cffeed tag tries to write to a file that exists, Lucee\ngenerates an error. (optional, default=false)",
            "default": false,
            "type": "boolean",
            "required": false
        },
        {
            "name": "overwriteenclosure",
            "description": "Used only for the read action.\nWhether to overwrite files in the enclosure directory if they already exist.\nIf you do not set this attribute to true and the cffeed tag tries to write to a file that exists, Lucee\ngenerates an error. (optional, default=false)",
            "default": false,
            "type": "boolean",
            "required": false
        },
        {
            "name": "properties",
            "description": "A structure containing the feed metadata, the information about the entire feed.\nCan contain either of the following:\n\n- The output of a read action.\n- Input to a create action.\n\nThe properties and query attributes combined provide complete feed information.\nWhen you specify the properties attribute for a create action, you must put it in pound signs (#)",
            "default": false,
            "type": "any",
            "required": false
        },
        {
            "name": "proxypassword",
            "description": "Password required by the proxy server.",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "proxyport",
            "description": "The port to connect to on the proxy server.",
            "default": false,
            "type": "number",
            "required": false
        },
        {
            "name": "proxyserver",
            "description": "Host name or IP address of a proxy server to which to send the request.",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "proxyuser",
            "description": "User name to provide to the proxy server.",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "query",
            "description": "A query object containing the Atom entries or RSS items in the feed. Can contain either of the following:\nThe output of a read action.\nInput to a create action.\nThe properties and query attributes combined provide complete feed information.\nWhen you specify the query attribute for a create action, you must put it in pound signs (#)",
            "default": false,
            "type": "any",
            "required": false
        },
        {
            "name": "source",
            "description": "Used only for the read action.\nThe URL of the feed or the path to the XML file that contains the feed contents.\nA path can be absolute, or relative to the CFML file.",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "timeout",
            "description": "The number of seconds to wait for a response from the feed source. A value of 0 specifies that the request does not time out.",
            "default": false,
            "type": "number",
            "required": false
        },
        {
            "name": "useragent",
            "description": "Text to put in the HTTP User-Agent request header field. Used to identify the request client software.",
            "default": false,
            "type": "string",
            "required": false
        },
        {
            "name": "xmlvar",
            "description": "A variable in which to save the read or created feed as XML text.",
            "default": false,
            "type": "string",
            "required": false
        }
    ]
}